In [12]:
import pandas as pd
import numpy as np

In [4]:
ser1 = pd.Series([1,2,3,4],index = ['USA','Germany','nepal','china'])

In [5]:
ser1

USA        1
Germany    2
nepal      3
china      4
dtype: int64

In [8]:
ser2 = pd.Series([1,2,3,4],index = ['djhd','dfjhd','nepal','cdkfjhina'])
ser2

djhd         1
dfjhd        2
nepal        3
cdkfjhina    4
dtype: int64

In [9]:
ser = ser1+ser2
ser

Germany      NaN
USA          NaN
cdkfjhina    NaN
china        NaN
dfjhd        NaN
djhd         NaN
nepal        6.0
dtype: float64

In [10]:
np.random.seed(11)

In [15]:
#import numpy.random as randn
df = pd.DataFrame(np.random.randint(1,20,(5,4)),index='A B C D E'.split())

In [16]:
df

    0   1   2   3
A  17  18  14  13
B   2   8  19  14
C  17   1  14  13
D   5   3  13   2
E  11   6   8  18

In [20]:
df[[1,2]]

    1   2
A  18  14
B   8  19
C   1  14
D   3  13
E   6   8

In [21]:
df[3]

A    13
B    14
C    13
D     2
E    18
Name: 3, dtype: int32

In [24]:
df['new'] = df[2]+df[3]
df

    0   1   2   3  new
A  17  18  14  13   27
B   2   8  19  14   33
C  17   1  14  13   27
D   5   3  13   2   15
E  11   6   8  18   26

In [27]:
# delect
#1= column and 0= row
df.drop("new",axis = 1)

    0   1   2   3
A  17  18  14  13
B   2   8  19  14
C  17   1  14  13
D   5   3  13   2
E  11   6   8  18

In [28]:
df

    0   1   2   3  new
A  17  18  14  13   27
B   2   8  19  14   33
C  17   1  14  13   27
D   5   3  13   2   15
E  11   6   8  18   26

In [29]:
df =df.drop("new",axis = 1)
df

    0   1   2   3
A  17  18  14  13
B   2   8  19  14
C  17   1  14  13
D   5   3  13   2
E  11   6   8  18

In [30]:
df.drop("A")

    0  1   2   3
B   2  8  19  14
C  17  1  14  13
D   5  3  13   2
E  11  6   8  18

In [32]:
# naming a label
df.loc['A']

0    17
1    18
2    14
3    13
Name: A, dtype: int32

In [33]:
# location as index
df.iloc[2]

0    17
1     1
2    14
3    13
Name: C, dtype: int32

In [34]:
df.loc[['A','B']]

    0   1   2   3
A  17  18  14  13
B   2   8  19  14

In [35]:
df.iloc[[1,3]]

   0  1   2   3
B  2  8  19  14
D  5  3  13   2

In [36]:
df>3

       0      1     2      3
A   True   True  True   True
B  False   True  True   True
C   True  False  True   True
D   True  False  True  False
E   True   True  True   True

In [37]:
df[df>4]

      0     1   2     3
A  17.0  18.0  14  13.0
B   NaN   8.0  19  14.0
C  17.0   NaN  14  13.0
D   5.0   NaN  13   NaN
E  11.0   6.0   8  18.0

In [38]:
df['state'] = {1,2,4,6,8,}
df

    0   1   2   3  state
A  17  18  14  13      1
B   2   8  19  14      2
C  17   1  14  13      4
D   5   3  13   2      6
E  11   6   8  18      8

In [41]:
df.set_index('state')

        0   1   2   3
state
1      17  18  14  13
2       2   8  19  14
4      17   1  14  13
6       5   3  13   2
8      11   6   8  18

In [42]:
df.set_index('state',inplace=True)

In [43]:
df

        0   1   2   3
state
1      17  18  14  13
2       2   8  19  14
4      17   1  14  13
6       5   3  13   2
8      11   6   8  18